# -*- org-export-babel-evaluate: nil; org-export-allow-bind-keywords: t; -*-
#+AUTHOR: Malcolm Cook;
#+EMAIL: malcolm_cook@stowers.org
#+TITLE: Installing Trans Proteomic Pipeline (TPP) on CentOS 7

#+SETUPFILE: ~mec/.emacs.d/org/SETUPFILE.org
#+PROPERTY: header-args:sh :session *shell* :results output :exports both :colnames yes :width 10 :height 7.5 :units in

**  get a little report on what tpp thinks you're building on
#+begin_src  sh
make info
#+end_src

#+RESULTS:
#+begin_example
ARCH = x86_64
VENDOR = redhat
SYSTEM = linux
    OS = Linux

TPP_VERSION = 6.1.0
TPP_RELEASE = Parhelion
TPP_BUILDID = TPP v6.1.0 Parhelion, Build 202206071204-exported (Linux-x86_64)

    SRC_DIR = /n/sci/SCI-004255-ZFPROT/tpp/svn/trans_proteomic_pipeline
  BUILD_DIR = /n/sci/SCI-004255-ZFPROT/tpp/svn/trans_proteomic_pipeline/build/linux-x86_64-release
INSTALL_DIR = /usr/local/tpp

   TPP_HOME = /usr/local/tpp
TPP_DATADIR = /data/tpp
TPP_BASEURL = /tpp
TPP_DATAURL = /tpp/data

 MZ5_SUPPORT is not enabled
#+end_example

